Revit 2027 API
BuiltInFailures.RebarFailures.NoSurfPatternOnRebar Property
 Rebar elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Rebar Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSurfPatternOnRebar { get; }
Public Shared ReadOnly Property NoSurfPatternOnRebar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSurfPatternOnRebar {
	FailureDefinitionId^ get ();
}
static member NoSurfPatternOnRebar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace